{"labels": ["airplane", "baseball", "boxing", "guitar", "hands_up", "muscle", "robot", "salute", "star", "superhero", "wave", "weightlifting"], "layers": [{"name": "lstm", "class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 30, 99], "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "weights": [{"shape": [99, 256], "data": [0.10007858276367188, 0.07850030064582825, 0.061623990535736084, 0.024924850091338158, -0.09595056623220444, 0.0013377855066210032, 0.02842416800558567, -0.09573133289813995, 0.002266992349177599, -0.12373405694961548, 0.014782533049583435, 0.06788653880357742, -0.037153732031583786, 0.07862547785043716, 0.03427364304661751, -0.019966628402471542, -0.025341367349028587, 0.11714032292366028, 0.007362695876508951, -0.053401604294776917, 0.040220461785793304, -0.0016855656867846847, 0.07462383061647415, 0.08403927087783813, 0.06272328644990921, -0.11111658811569214, 0.03762395679950714, 0.06348419189453125, 0.005958607420325279, 0.030363786965608597, 0.07116010040044785, 0.11250324547290802, -0.10457128286361694, 0.10185860842466354, 0.01133657991886139, 0.0969579815864563, 0.08129633963108063, 0.08686165511608124, 0.07742547243833542, -0.03967956081032753, -0.00873251911252737, 0.042819567024707794, -0.04270704463124275, -0.07376401126384735, -0.09924868494272232, 0.06832701712846756, 0.06918273121118546, 0.10380476713180542, -0.034451279789209366, 0.11034604907035828, -0.0634303018450737, 0.031083444133400917, 0.04023836553096771, 0.014025184325873852, 0.04786058887839317, -0.04377736523747444, -0.015265975147485733, 0.08257770538330078, -0.03752417862415314, 0.028913823887705803, -0.00044256486580707133, 0.015212827362120152, 0.12969596683979034, -0.12745632231235504, -0.035422466695308685, 0.05889734998345375, -0.02979089878499508, -0.04554719850420952, -0.011167568154633045, -0.02705192379653454, 0.1257789433002472, 0.054015375673770905, -0.02086237259209156, 0.017410866916179657, -0.03982151299715042, -0.03433077037334442, -0.10567562282085419, 0.09876958280801773, -0.02188676968216896, -0.09374535828828812, 0.05469628795981407, 0.04694080352783203, -0.005096152890473604, -0.027618825435638428, 0.11157834529876709, 0.030605865642428398, -0.026944952085614204, 0.09249168634414673, -0.05058817192912102, 0.01390750240534544, -0.08889885246753693, 0.04752662777900696, 0.10769388824701309, 0.08669494837522507, 0.057941656559705734, 0.12675020098686218, -0.12140288949012756, 0.15350386500358582, -0.05586973577737808, -0.019362321123480797, -0.061263278126716614, 0.02994677796959877, 0.05197443440556526, 0.004142233170568943, 0.08856357634067535, 0.10139964520931244, -0.01873195171356201, -0.01028082799166441, -0.016647569835186005, 0.07046477496623993, -0.11283236742019653, -0.027378488332033157, -0.08586884289979935, -0.018695898354053497, -0.017661714926362038, 0.02749772183597088, 0.09289703518152237, -0.10046911984682083, 0.002280201530084014, -0.03711644187569618, -0.09055542200803757, -0.07833179831504822, -0.10949479788541794, 0.0907132551074028, -0.020176857709884644, 0.04142004996538162, 0.027560468763113022, -0.018377583473920822, 0.08237069845199585, -0.017581500113010406, -0.04263494163751602, 0.001825897372327745, -0.11640314757823944, 0.03905138373374939, -0.11191125214099884, -0.0581459142267704, -0.03969605267047882, 0.01287479791790247, 0.0177773330360651, -0.05357302725315094, -0.10169526189565659, 0.11009221524000168, -0.04620968922972679, 0.033206142485141754, -0.039947714656591415, 0.09737368673086166, -0.055487848818302155, -0.01638101413846016, 0.036236342042684555, 0.09724898636341095, -0.009550169110298157, 0.11306530237197876, 0.09804271906614304, 0.10356861352920532, -0.0423019677400589, -0.0310746468603611, -0.08338096737861633, -0.11924529820680618, -0.024204270914196968, 0.07033076882362366, -0.04384475201368332, -0.029902901500463486, -0.09966389834880829, -0.07186008989810944, 0.09315576404333115, -0.03745518624782562, -0.0744626373052597, 0.031115146353840828, -0.07593658566474915, 0.014607447199523449, -0.11288933455944061, -0.012383846566081047, -0.0644524022936821, -0.10839445888996124, -0.08908527344465256, 0.013084609061479568, -0.07538603991270065, 0.055312126874923706, -0.08177115023136139, -0.11228626221418381, 0.059925515204668045, -0.12821683287620544, -0.04157935455441475, 0.09502258896827698, -0.10965779423713684, -0.10799106955528259, -0.08747662603855133, -0.08584617078304291, 0.10195311158895493, -0.060732562094926834, 0.033763643354177475, -0.03315556421875954, -0.11259085685014725, 0.1016746312379837, 0.15543147921562195, 0.01563495211303234, 0.050112176686525345, 0.13447017967700958, -0.10783880949020386, -0.01996103674173355, -0.04472131282091141, 0.08806022256612778, -0.13150984048843384, -0.05128435790538788, 0.08248307555913925, -0.036653898656368256, 0.06670798361301422, 0.06939026713371277, 0.09549802541732788, 0.10524974763393402, 0.01627347804605961, -0.059024181216955185, 0.061320435255765915, 0.07489047944545746, 0.1124061867594719, -0.10694076865911484, 0.11258123070001602, -0.010513139888644218, 0.08752047270536423, 0.007355343550443649, -0.0717615857720375, 0.12812401354312897, -0.10688932240009308, 0.1353786289691925, -0.11618343740701675, -0.11931939423084259, 0.05847272649407387, -0.08120405673980713, 0.1562870442867279, 0.00012319430243223906, -0.07099684327840805, 0.10848025232553482, -0.09605443477630615, -0.06605566293001175, -0.08752806484699249, 0.006746749393641949, -0.0783582404255867, 0.017721040174365044, -0.0051649524830281734, 0.037782542407512665, -0.09251804649829865, 0.04009998217225075, 0.12695789337158203, -0.01580083556473255, -0.05106724798679352, 0.12040889263153076, 0.060908690094947815, -0.06054270267486572, 0.0695115476846695, 0.023519404232501984, -0.01309105847030878, 0.0333121195435524, -0.12763863801956177, 0.00455498369410634, 0.12846481800079346, -0.07974766194820404, -0.05101493000984192, -0.05691952630877495, -0.055588603019714355, 0.09494246542453766, 0.024536265060305595, 0.03048592060804367, -0.06630148738622665, -0.02002476155757904, 0.013339497148990631, -0.07722603529691696, -0.11420702189207077, 0.10661125183105469, 0.06639101356267929, -0.12864524126052856, -0.18324491381645203, 0.002913358621299267, -0.10598280280828476, 0.1420280486345291, 0.016004305332899094, 0.10386644303798676, 0.05287560448050499, -0.12151093780994415, 0.12826180458068848, -0.11205248534679413, 0.1176658347249031, 0.06170021370053291, -0.03746120259165764, 0.08668247610330582, -0.03803097456693649, 0.027397284284234047, -0.1495409458875656, 0.14070715010166168, 0.042444854974746704, -0.00239716493524611, 0.01032008696347475, 0.040854621678590775, 0.1301644742488861, -0.07408978044986725, -0.06430027633905411, -0.02458898350596428, 0.03329911082983017, 0.059620339423418045, 0.022096579894423485, 0.13814452290534973, -0.05290345475077629, -0.0989944338798523, -0.017300160601735115, 0.14168870449066162, 0.05444999039173126, 0.10193232446908951, 0.14007918536663055, 0.06554630398750305, 0.054238948971033096, -0.07730738073587418, -0.08704231679439545, -0.03633743152022362, 0.09104887396097183, -0.01324249804019928, -0.15302404761314392, -0.062290795147418976, -0.011081945151090622, -0.12136770039796829, -0.07017913460731506, -0.1293184906244278, 0.05987896770238876, -0.09036725759506226, 0.10570097714662552, -0.032834235578775406, 0.08530338853597641, -0.13276728987693787, -0.030000708997249603, -0.03847412019968033, -0.042534567415714264, -0.09934423863887787, 0.08826243877410889, 0.03371456637978554, 0.06557562202215195, -0.040132567286491394, 0.04869616776704788, -0.026568038389086723, 0.03788698464632034, 0.09679614007472992, 0.1288071870803833, -0.07858296483755112, 0.07586146891117096, 0.11882349103689194, 0.12064219266176224, -0.05113227665424347, -0.024842968210577965, -0.05769854038953781, -0.006647815462201834, -0.024023838341236115, 0.03869647532701492, 0.0818299651145935, -0.0654054582118988, 0.01853782683610916, 0.11090277880430222, -0.039283156394958496, 0.008736922405660152, 0.07171912491321564, -0.04396246373653412, 0.14237068593502045, 0.047693368047475815, 0.07094413787126541, -0.07201065868139267, -0.1414114385843277, 0.01604163460433483, -0.11490201950073242, 0.011238145641982555, 0.11025183647871017, 0.10813387483358383, 0.15836979448795319, -0.12622599303722382, -0.10070863366127014, -0.07538268715143204, 0.05316728726029396, -0.0017877762438729405, -0.13169322907924652, -0.061969105154275894, -0.13442672789096832, -0.0954432263970375, 0.08064243942499161, -0.0771716982126236, -0.026273900642991066, 0.0645371600985527, 0.10230924934148788, 0.028996238484978676, 0.08075208216905594, -0.1354026049375534, -0.05511307716369629, 0.027286604046821594, 0.026634151116013527, 0.022479936480522156, -0.013053675182163715, -0.02001095563173294, -0.017186228185892105, -0.0482470840215683, 0.005236788187175989, 0.03216729313135147, 0.07388825714588165, 0.13733512163162231, -0.024053841829299927, -0.0769820287823677, -0.028332028537988663, 0.12162606418132782, -0.08245763927698135, -0.06903640925884247, -0.13022279739379883, 0.08405891805887222, -0.12695364654064178, -0.03599028289318085, 0.06642932444810867, -0.06933257728815079, 0.09042614698410034, -0.010118481703102589, -0.03239841014146805, -0.008157827891409397, 0.0594511516392231, -0.046285275369882584, -0.03983952850103378, -0.10361481457948685, -0.034098993986845016, 0.10146339237689972, -0.07998836785554886, -0.06438735872507095, -0.12096798419952393, -0.11446357518434525, 0.0383366122841835, -0.1401824951171875, -0.007211732212454081, -0.0779881626367569, 0.06115489825606346, 0.07869968563318253, 0.012539391405880451, 0.09916753321886063, -0.09574144333600998, -0.07679823786020279, -0.04678787663578987, 0.02170703001320362, 0.051624689251184464, -0.13403545320034027, 0.013580746948719025, -0.046976130455732346, -0.05166459083557129, -0.08270815759897232, 0.06600823253393173, -0.044281426817178726, 0.051481086760759354, 0.09202941507101059, 0.08994325250387192, 0.12079335004091263, -0.07056265324354172, 0.12873481214046478, -0.08292587846517563, 0.05172412842512131, -0.008895552717149258, -0.07922342419624329, 0.031499478965997696, 0.052672114223241806, 0.05059057101607323, -0.10433867573738098, -0.021369565278291702, -0.003088422119617462, -0.10691675543785095, -0.11876661330461502, -0.13059647381305695, -0.01555426325649023, -0.13388203084468842, 0.12157531827688217, 0.17292572557926178, 0.061625201255083084, 0.0030699758790433407, 0.13777685165405273, 0.014809953980147839, 0.09476058930158615, 0.027909347787499428, 0.06802948564291, 0.08386994153261185, -0.06261514127254486, 0.03848990797996521, 0.14518316090106964, 0.1502651870250702, -0.07860121130943298, 0.0015188499819487333, 0.10652060061693192, 0.11328817158937454, 0.07570932805538177, -0.02903863787651062, -0.08660230785608292, -0.038591861724853516, 0.07213276624679565, -0.04348954185843468, 0.11916399747133255, -0.08335649967193604, -0.01495279185473919, 0.0962839424610138, 0.11175938695669174, 0.12757322192192078, -0.12827613949775696, 0.10923293977975845, 0.06122289225459099, -0.026900211349129677, -0.06374090164899826, -0.029603449627757072, -0.09158898890018463, -0.11800207197666168, 0.007726848125457764, 0.021876435726881027, 0.008881942369043827, 0.0754290446639061, 0.049093764275312424, 0.06534068286418915, -0.07195039093494415, 0.08618904650211334, -0.03243174031376839, 0.09350470453500748, 0.022847682237625122, 0.03714200109243393, 0.03160812333226204, 0.07189837843179703, -0.12219845503568649, 0.0535263754427433, -0.03810616955161095, -0.09077762812376022, 0.06840109080076218, -0.07064498960971832, 0.10991133004426956, 0.0784098356962204, -0.10146523267030716, -0.024976415559649467, -0.039950527250766754, 0.10002898424863815, -0.07944415509700775, -0.03666938841342926, -0.11873102933168411, -0.13831856846809387, 0.07205571979284286, -0.028917524963617325, -0.12905412912368774, -0.024855084717273712, 0.12264847755432129, -0.04556179791688919, -0.10550786554813385, -0.0724104642868042, 0.08908464759588242, 0.06744945794343948, 0.07248520106077194, 0.0815659910440445, 0.007611261215060949, -0.07341169565916061, 0.13905121386051178, 0.02634873427450657, 0.0467057041823864, 0.056878432631492615, -0.01580778881907463, 0.03173722326755524, -0.018830668181180954, 0.058704935014247894, 0.01726529374718666, -0.16600169241428375, -0.09855536371469498, 0.07741034775972366, 0.000748859834857285, 0.0009401732822880149, -0.06634251773357391, -0.12241280823945999, 0.07312139123678207, -0.0661994144320488, -0.03307001292705536, 0.12046448141336441, 0.05823643505573273, -0.05991546809673309, 0.09394771605730057, 0.04365091770887375, 0.11119092255830765, -0.08977649360895157, -0.02627146802842617, 0.13026580214500427, 0.06759176403284073, -0.027122607454657555, -0.03093617968261242, -0.1059763953089714, -0.14066150784492493, -0.0662851482629776, -0.08547991514205933, 0.11178966611623764, 0.016972452402114868, 0.011302563361823559, 0.10766812413930893, 0.0313066728413105, 0.10954160243272781, -0.11148928850889206, -0.02387038990855217, 0.012683562003076077, 0.10612349212169647, -0.07609821856021881, 0.09931732714176178, 0.03852648660540581, 0.006462173070758581, -0.043429143726825714, 0.005960028152912855, -0.02761310338973999, -0.13209816813468933, -0.12123603373765945, -0.014998767524957657, 0.027075184509158134, 0.02024550922214985, 0.021712010726332664, -0.11321084201335907, -0.10565546154975891, -0.07222093641757965, -0.03511718660593033, 0.047503527253866196, -0.15804333984851837, 0.06367501616477966, -0.0789678692817688, -0.13086774945259094, -0.008862977847456932, 0.07682126015424728, 0.03939807415008545, 0.09096305817365646, 0.0218545850366354, -0.05644084885716438, -0.020957406610250473, -0.056420113891363144, 0.05223633721470833, 0.11768388748168945, 0.04305165261030197, 0.1033986285328865, 0.05241764709353447, -0.11677251011133194, 0.09615670889616013, 0.050277139991521835, 0.05762312561273575, -0.1322501003742218, 0.010977116413414478, 0.044284820556640625, 0.03864581510424614, 0.06783148646354675, 0.013767046853899956, -0.04322865605354309, 0.0818173736333847, 0.0013053793227300048, -0.10016127675771713, -0.11685914546251297, -0.1280093789100647, -0.050324372947216034, 0.10003684461116791, 0.006312855519354343, -0.107294462621212, -0.010213189758360386, 0.021699825301766396, -0.0013612945331260562, 0.024182744324207306, -0.02326466143131256, -0.12251481413841248, -0.11745128035545349, 0.052817557007074356, -0.0862102061510086, 0.14907105267047882, 0.07701972872018814, 0.07882234454154968, -0.08178234100341797, -0.04167216643691063, -0.06993824243545532, -0.0412755124270916, -0.036090508103370667, -0.07380616664886475, -0.009774187579751015, 0.04955410957336426, -0.12296013534069061, 0.07886827737092972, 0.12872366607189178, -0.10403817147016525, -0.11814823001623154, -0.03153650462627411, -0.011833266355097294, -0.11313765496015549, 0.07056613266468048, -0.03245781362056732, 0.12881943583488464, -0.10557811707258224, 0.10877582430839539, 0.10912405699491501, -0.00011396415357012302, -0.028530238196253777, -0.1010546088218689, 0.025513622909784317, 0.12548977136611938, -0.012863628566265106, 0.04739906266331673, -0.09588631987571716, -0.0699853003025055, -0.08044855296611786, 0.05875198915600777, 0.12012486904859543, 0.07295448333024979, -0.029827861115336418, 0.08234282582998276, -0.08057006448507309, -0.05680125951766968, 0.0431252121925354, -0.11570239067077637, -0.03825806826353073, -0.09426567703485489, 0.04515228420495987, -0.013169389218091965, -0.03077489510178566, -0.0724034532904625, -0.0762840285897255, 0.09892718493938446, -0.020686618983745575, -0.10857149958610535, -0.07054992020130157, 0.13310284912586212, -0.08009178191423416, 0.10457784682512283, -0.07026387751102448, -0.12199168652296066, -0.05920333415269852, 0.07728951424360275, 0.010844883508980274, 0.1263953298330307, 0.13029639422893524, -0.10137022286653519, 0.07684899121522903, -0.10033230483531952, 0.086930051445961, 0.08214119076728821, 0.027357306331396103, -0.13849511742591858, 0.019368711858987808, -0.024858007207512856, -0.02190008945763111, 0.07235052436590195, -0.10650486499071121, -0.07532639801502228, 0.13868483901023865, 0.06679655611515045, -0.08037759363651276, -0.03345555067062378, 0.007615505252033472, 0.0076786065474152565, -0.06830659508705139, -0.02336614392697811, -0.08370143175125122, 0.04118850454688072, 0.0416303388774395, 0.1138465628027916, 0.04342320188879967, -0.0590292289853096, -0.17535468935966492, 0.08505742996931076, 0.024308079853653908, 0.058685630559921265, 0.05335468798875809, -0.0037950712721794844, -0.07095250487327576, -0.007646439131349325, 0.013534044846892357, 0.11073648929595947, -0.06981576234102249, 0.007883414626121521, -0.017065735533833504, -0.140543594956398, -0.13931278884410858, 0.09840015321969986, 0.07316430658102036, 0.04605434462428093, -0.025827938690781593, -0.1457824856042862, -0.03867507353425026, -0.06310826539993286, -0.04713510721921921, -0.08246663212776184, -0.03307298570871353, 0.11491040140390396, -0.10383866727352142, -0.13536401093006134, -0.10906387120485306, -0.0638536661863327, -0.08955094963312149, 0.041051436215639114, 0.12843656539916992, 0.007326536346226931, 0.08610385656356812, -0.05220433324575424, 0.04456964135169983, -0.015028772875666618, -0.04064887762069702, -0.05102210491895676, 0.05336391180753708, 0.09829345345497131, -0.06140094995498657, -0.006795925088226795, 0.1309264898300171, 0.1429874300956726, -0.14319364726543427, 0.1459444761276245, 0.11607187241315842, -0.05892704427242279, 0.1360829919576645, -0.05445391312241554, 0.06026127189397812, 0.10569652915000916, 0.13733895123004913, -0.015518623404204845, 0.08813956379890442, 0.06083637848496437, -0.10089662671089172, -0.1252935230731964, -0.07524418085813522, 0.02425154112279415, -0.0934658870100975, -0.037621915340423584, -0.034391917288303375, 0.13500910997390747, 0.1137496754527092, -0.0585985891520977, -0.003090921090915799, -0.0631539523601532, -0.09625224769115448, 0.10403446108102798, -0.05078953504562378, 0.023705264553427696, 0.07930795848369598, -0.07977356016635895, 0.003370995167642832, -0.024356674402952194, -0.03804606571793556, -0.10510070621967316, -0.06975090503692627, -0.1026478111743927, -0.06439711153507233, -0.1181507408618927, -0.09186059981584549, -0.03201239928603172, 0.00206721480935812, -0.06676648557186127, 0.029572783038020134, 0.016668979078531265, -0.08292865008115768, 0.09311911463737488, -0.12037800252437592, 0.022936644032597542, 0.058928199112415314, -0.021848581731319427, 0.001969975419342518, -0.05118928477168083, -0.04463190585374832, 0.07434774935245514, -0.12113161385059357, 0.028848936781287193, 0.06315620243549347, -0.02292417362332344, 0.10186177492141724, 0.07550838589668274, -0.04449569061398506, -0.015945669263601303, 0.09691832214593887, -0.10836147516965866, -0.13877436518669128, 0.1082901582121849, 0.09900613874197006, 0.0314708836376667, -0.009835777804255486, -0.03617832437157631, 0.00879188347607851, 0.11913137137889862, 0.03384632244706154, -0.0892912745475769, -0.03557395562529564, 0.04220955818891525, -0.015039458870887756, -0.03483179584145546, 0.09192664176225662, 0.07041968405246735, -0.016826512292027473, -0.1293146014213562, -0.08154928684234619, -0.08505883067846298, -0.0876089408993721, -0.04809710383415222, -0.05922993645071983, 0.10613381862640381, 0.02836771123111248, 0.13823071122169495, 0.13853582739830017, -0.013178852386772633, 0.07556089013814926, -0.01724155806005001, 0.1057051420211792, -0.03205370157957077, 0.08802150934934616, -0.11306019127368927, 0.1106644794344902, -0.00041224423330277205, 0.057858098298311234, -0.0718092992901802, 0.08936025947332382, -0.017067985609173775, 0.08030877262353897, -0.031197506934404373, 0.01827605441212654, -0.09589461237192154, -0.05865481123328209, -0.05026968941092491, -0.11863690614700317, 0.06684885174036026, -0.13828954100608826, -0.10671107470989227, -0.08207391947507858, -0.07651346921920776, -0.012075095437467098, 0.04768335446715355, 0.04795360565185547, -0.08584500849246979, 0.04634546861052513, 0.02039176970720291, -0.010682180523872375, -0.07250713557004929, -0.07175511121749878, 0.03099842742085457, -0.07401639968156815, 0.11218217760324478, 0.08053993433713913, 0.010495802387595177, -0.05719522759318352, 0.050863876938819885, 0.05155891180038452, 0.10657228529453278, -0.014874828979372978, -0.11376387625932693, 0.12902791798114777, 0.12660719454288483, -0.045366737991571426, 0.014146492816507816, 0.050209276378154755, -0.0644698217511177, 0.10309270769357681, -0.02248224802315235, 0.007409442216157913, -0.09881896525621414, -0.017976799979805946, -0.11762221902608871, 0.06015660986304283, -0.011420990340411663, -0.08716988563537598, 0.030878707766532898, 0.07996442168951035, 0.08520124107599258, 0.035679545253515244, -0.06893827021121979, -0.007521513383835554, -0.025066599249839783, -0.05650990828871727, -0.053598642349243164, -0.08595051616430283, 0.062463779002428055, -0.09766892343759537, 0.008893303573131561, 0.12262202799320221, 0.04081866517663002, -0.012994467280805111, -0.10264378041028976, -0.029420292004942894, 0.1135217547416687, 0.048512086272239685, 0.013990962877869606, -0.006241480819880962, -0.028932563960552216, 0.014935348182916641, -0.07674192637205124, -0.044641390442848206, 0.09937883168458939, -0.11094126850366592, -0.10221424698829651, -0.020726030692458153, -0.03819488361477852, 0.09048198163509369, 0.10058169811964035, 0.06016015261411667, 0.09211818128824234, -0.07357192784547806, 0.016039257869124413, 0.11099103093147278, 0.10086988657712936, 0.01963241957128048, -0.06485830992460251, -0.07437454164028168, 0.014444326050579548, 0.01493979711085558, 0.04536888003349304, 0.0265728160738945, -0.011652081273496151, -0.027255510911345482, 0.05069155618548393, -0.08100472390651703, -0.02256244793534279, 0.018779084086418152, 0.12008605897426605, -0.028345458209514618, -0.013555031269788742, -0.026308828964829445, 0.11645498126745224, -0.1056053638458252, 0.0940968319773674, 0.1628825068473816, 0.022029336541891098, 0.005499118473380804, -0.12520082294940948, 0.06885867565870285, -0.013331315480172634, 0.03786434978246689, 0.024271219968795776, 0.012207168154418468, -0.1204613670706749, -0.045002084225416183, 0.11507870256900787, 0.10490859299898148, -0.09027403593063354, 0.06378830969333649, -0.0361337773501873, 0.06773948669433594, 0.11243895441293716, -0.11978664994239807, 0.08425604552030563, 0.04351223632693291, 0.11524283140897751, 0.0038845243398100138, 0.045993853360414505, -0.029041746631264687, -0.011097998358309269, 0.03470191732048988, 0.03818909451365471, 0.07146315276622772, 0.011933858506381512, 0.015097668394446373, 0.07308630645275116, 0.05186117812991142, -0.12215442955493927, -0.07298998534679413, -0.14683344960212708, 0.07610943913459778, 0.023874681442975998, -0.044083453714847565, -0.011059739626944065, -0.0613924004137516, 0.06992563605308533, -0.00205934583209455, 0.01701059564948082, -0.07551375031471252, 0.15423204004764557, 0.08954684436321259, 0.02235768549144268, -0.045371491461992264, 0.15514637529850006, -0.017181338742375374, -0.004534590058028698, 0.12161112576723099, -0.04933997616171837, 0.1258443146944046, -0.07624311000108719, 0.08061948418617249, -0.03565455973148346, -0.08144547045230865, 0.14643606543540955, 0.04173843190073967, 0.11714503169059753, -0.008887879550457, 0.061547618359327316, -0.07280435413122177, -0.11305736005306244, 0.04218297079205513, 0.012772826477885246, 0.012921957299113274, -0.006821953225880861, 0.13600072264671326, -0.0434228889644146, -0.02150660566985607, 0.11963070183992386, 0.03610321506857872, 0.021490920335054398, 0.00756748765707016, 0.08211414515972137, -0.07329355180263519, -0.13381752371788025, -0.07002958655357361, -0.10597369819879532, -0.001666001626290381, 0.10303918272256851, -0.10425308346748352, 0.06153018772602081, 0.10390331596136093, -0.002116109011694789, 0.13045233488082886, 0.026128757745027542, -0.14085660874843597, 0.002546883188188076, 0.10297486931085587, 0.11100120842456818, -0.0572790652513504, 0.06155717372894287, 0.10783199220895767, 0.07569526135921478, 0.02716621197760105, -0.049747858196496964, 0.10082486271858215, -0.04875224828720093, 0.013003266416490078, 0.06829866021871567, -0.053465817123651505, -0.0043527353554964066, -0.016170203685760498, -0.08182376623153687, 0.06604514271020889, 0.12619327008724213, 0.001996544888243079, -0.01080965343862772, -0.10013459622859955, 0.031985364854335785, 0.12272074818611145, -0.017857613041996956, -0.026782160624861717, 0.1196248009800911, -0.10087081789970398, -0.0897170752286911, 0.11132610589265823, -0.041124869138002396, 0.07939102500677109, -0.06603580713272095, -0.07101472467184067, -0.0687146931886673, -0.06707369536161423, -0.09239089488983154, 0.02084553986787796, 0.08594966679811478, -0.0955318808555603, -0.07546032220125198, 0.026472395285964012, -0.08755147457122803, -0.07653743028640747, 0.11300034075975418, -0.09150063246488571, 0.05666790530085564, 0.07641997188329697, -0.024451524019241333, -0.0746716633439064, 0.025242049247026443, 0.1393262892961502, -0.08587176352739334, -0.030460134148597717, 0.06977128982543945, 0.019006967544555664, 0.11576894670724869, -0.037537384778261185, 0.11300378292798996, -0.00957615114748478, 0.05335279181599617, 0.1394321620464325, 0.11485973000526428, 0.038663800805807114, -0.06409568339586258, -0.08794278651475906, -0.07035946100950241, -0.0638592466711998, -0.05505148321390152, 0.055048320442438126, -0.009520233608782291, -0.08544202893972397, -0.015986505895853043, 0.03086981177330017, -0.0945737361907959, 0.06673985719680786, -0.06436646729707718, -0.060202836990356445, 0.08574073761701584, -0.03071846067905426, 0.09124301373958588, -0.023380402475595474, 0.12851281464099884, 0.09993141889572144, -0.007497790735214949, -0.0714339017868042, 0.00023836636682972312, 0.15201416611671448, 0.10087732970714569, -0.0902690589427948, 0.019861921668052673, -0.03936222195625305, 0.09276557713747025, -0.09224645048379898, 0.10307153314352036, -0.08896387368440628, -0.01431223750114441, 0.04687756299972534, -0.12975530326366425, -0.10414610058069229, 0.05425160750746727, -0.008811496198177338, -0.12285220623016357, 0.045072488486766815, -0.020552141591906548, -0.07010071724653244, -0.04088654741644859, -0.06567235291004181, 0.1252199411392212, -0.0580599345266819, -0.005437752697616816, 0.021453166380524635, -0.12896496057510376, -0.10082735121250153, -0.04099181666970253, 0.01622316986322403, 0.029222745448350906, 0.028899317607283592, 0.09592686593532562, -0.12113063782453537, 0.08634026348590851, -0.08066963404417038, -0.00718656275421381, 0.07626993209123611, 0.036367300897836685, -0.10629303753376007, -0.03384845331311226, -0.13224449753761292, 0.1220930963754654, 0.08974948525428772, -0.09194023162126541, 0.04191235825419426, 0.003616277826949954, 0.1276964545249939, -0.01935679279267788, -0.07692407071590424, -0.012551888823509216, -0.004268179647624493, 0.0160308089107275, 0.0988355204463005, -0.03208022192120552, 0.01622995361685753, 0.07430627942085266, -0.028473051264882088, -0.08443312346935272, 0.10948767513036728, 0.0392463244497776, 0.017817851155996323, 0.1182934045791626, -0.11351493000984192, 0.1331324279308319, 0.007934234105050564, 0.05732385441660881, -0.050083357840776443, -0.042064815759658813, -0.019041497260332108, 0.07078131288290024, 0.007983257994055748, 0.006415305659174919, 0.06441816687583923, 0.05395011976361275, 0.10307063162326813, 0.06380540877580643, -0.03476303443312645, -0.129739448428154, 0.05314282700419426, -0.024473587051033974, -0.05001649633049965, 0.11547314375638962, -0.03450071066617966, -0.03849099203944206, -0.09905761480331421, -0.06366408616304398, 0.15594306588172913, -0.040229663252830505, 0.10382547974586487, 0.09002748876810074, -0.04563920199871063, -0.12946444749832153, -0.064301498234272, 0.03601352125406265, -0.06119120866060257, -0.022352436557412148, -0.08064860850572586, 0.13271464407444, -0.06985925883054733, 0.03459736332297325, 0.09334208071231842, 0.0014900529058650136, 0.03931879252195358, -0.0289303008466959, -0.08699991554021835, -0.07406719028949738, 0.11976220458745956, -0.06915057450532913, -0.1041209027171135, 0.05875261127948761, 0.06540008634328842, -0.12159064412117004, -0.011081721633672714, -0.03521377220749855, -0.07674425840377808, -0.020085737109184265, 0.010451569221913815, -0.10061683505773544, -0.060116108506917953, -0.06115352362394333, 0.1035919114947319, 0.013762247748672962, 0.08894336968660355, 0.04919452965259552, 0.051578767597675323, -0.12012172490358353, -0.10673888772726059, 0.044126372784376144, 0.07514042407274246, 0.12187598645687103, -0.03423905745148659, -0.02554057352244854, -0.04067602753639221, -0.08182337880134583, 0.03595151752233505, -0.006105026695877314, -0.14877758920192719, 0.03267083317041397, 0.0844515711069107, 0.04724447801709175, 0.13225886225700378, -0.10172072798013687, -0.0009354266803711653, -0.1765183061361313, 0.08258324861526489, 0.06823042035102844, -0.1503051370382309, -0.03761693835258484, 0.022243354469537735, 0.07626259326934814, -0.14125590026378632, 0.03162340447306633, 0.13465800881385803, 0.07601919770240784, -0.019982989877462387, -0.08453841507434845, -0.064470574259758, -0.03797348961234093, -0.011297370307147503, -0.025756366550922394, -0.04177480563521385, -0.12791228294372559, -0.0015487649943679571, -0.10910806804895401, -0.06991148740053177, -0.08561764657497406, -0.06360433995723724, 0.10380909591913223, -0.1013718694448471, 0.08716314285993576, 0.1166752502322197, -0.052499860525131226, -0.10155996680259705, 0.037114039063453674, -0.04643615335226059, 0.06677168607711792, -0.06188889965415001, 0.083586685359478, 0.07735542207956314, 0.07157911360263824, -0.01421599555760622, -0.07068430632352829, -0.011105237528681755, 0.015311164781451225, 0.07908538728952408, -0.08161266148090363, -0.13553811609745026, 0.08095040172338486, 0.08152935653924942, -0.06580465286970139, -0.1282285898923874, -0.07002772390842438, 0.09567555785179138, 0.1324145644903183, -0.08519407361745834, -0.052067212760448456, -0.017566943541169167, -0.013666225597262383, 0.12288663536310196, 0.09461332112550735, 0.08724664896726608, -0.062082864344120026, 0.053409356623888016, -0.09194342792034149, 0.04271024093031883, 0.02298269048333168, 0.034392375499010086, 0.05124463886022568, 0.03392301872372627, -0.025808090344071388, -0.13320690393447876, -0.09062028676271439, 0.09668011963367462, -0.0009525790810585022, -0.06620415300130844, 0.12002124637365341, 0.08479790389537811, -0.08262750506401062, 0.09683751314878464, -0.02823900245130062, 0.03008967824280262, 0.0545763298869133, -0.03800516575574875, 0.06899799406528473, 0.06867852061986923, -0.03509068116545677, -0.1364634931087494, 0.13573262095451355, -0.031779203563928604, -0.0342337042093277, -0.11884880810976028, -0.08716138452291489, -0.1435142457485199, -0.05933311581611633, -0.0345146581530571, -0.10333148390054703, -0.07831139862537384, -0.06470157206058502, 0.02047441340982914, 0.005798729136586189, -0.003360171802341938, -0.11338906735181808, 0.062238194048404694, 0.09251632541418076, -0.09592188894748688, 0.004325186368077993, 0.08344902843236923, -0.11721788346767426, 0.09738004952669144, 0.024327008053660393, -0.06300431489944458, -0.06801823526620865, 0.11632645130157471, 0.09283163398504257, 0.07925977557897568, 0.06538968533277512, -0.09612342715263367, -0.08897726237773895, -0.038213007152080536, 0.12371700257062912, 0.1232878789305687, -0.0592254213988781, 0.11643969267606735, 0.020575229078531265, -0.048091985285282135, 0.0746205523610115, -0.02777908928692341, 0.07371225208044052, 0.06791128218173981, -0.05984976515173912, -0.04764479026198387, 0.055357083678245544, -0.07920628041028976, -0.06398472934961319, 0.11332360655069351, 0.0305497869849205, -0.10376707464456558, 0.07273148000240326, -0.010579011403024197, 0.08806249499320984, 0.10257403552532196, -0.057951364666223526, 0.06420943886041641, 0.0016438167076557875, 0.10224173218011856, 0.012963072396814823, 0.039897702634334564, 0.06851420551538467, 0.08611876517534256, 0.08148828893899918, 0.07780339568853378, -0.11856738477945328, 0.0934753343462944, 0.062114182859659195, -0.013726107776165009, 0.015534778125584126, 0.0352470725774765, 0.06261112540960312, -0.015725038945674896, 0.07454004883766174, 0.08347680419683456, -0.010852082632482052, 0.024117374792695045, 0.08212438225746155, 0.08547554910182953, -0.02692253142595291, 0.07992593944072723, -0.09769511967897415, -0.10016383975744247, 0.09643423557281494, 0.09431160241365433, 0.007800382096320391, -0.04944613203406334, -0.10779977589845657, -0.13626524806022644, 0.1516007035970688, -0.10848940163850784, 0.03492330387234688, -0.0374625064432621, -0.05717771127820015, 0.024271629750728607, 0.049908287823200226, 0.04885460436344147, 0.07153063267469406, -0.10517861694097519, -0.08320023119449615, -0.02023821696639061, 0.053187061101198196, -0.15181967616081238, 0.11096934229135513, -0.04149729758501053, 0.012420459650456905, -0.040789369493722916, -0.050939008593559265, -0.06015300378203392, -0.021999500691890717, 0.10529527813196182, -0.0985267236828804, 0.05105218663811684, 0.040932826697826385, -0.09946417808532715, -0.13437142968177795, -0.008649525232613087, 0.07419368624687195, -0.09718319028615952, 0.06881169229745865, -0.03438830003142357, -0.14367710053920746, -0.04461222514510155, -0.01733849011361599, 0.09182476252317429, 0.13255135715007782, -0.01146000623703003, -0.002967740874737501, 0.007401278708130121, 0.0745246559381485, 0.12296140193939209, 0.04706573486328125, 0.11832811683416367, 0.013578224927186966, 0.10490812361240387, -0.008643180131912231, 0.08211639523506165, 0.07655613124370575, -0.03646518290042877, 0.01907750964164734, -0.0917421504855156, 0.09682188183069229, -0.057417817413806915, -0.0643426924943924, 0.09911550581455231, 0.089922696352005, -0.03830728307366371, -0.10838959366083145, 0.07204939424991608, 0.048233289271593094, 0.0006472381646744907, -0.013297652825713158, 0.051780130714178085, -0.022507257759571075, -0.14414635300636292, 0.09483954310417175, -0.023575443774461746, 0.07641105353832245, -0.040298379957675934, -0.09346183389425278, 0.050864387303590775, -0.026243342086672783, -0.08184995502233505, 0.07438615709543228, 0.08873370289802551, 0.12080305069684982, 0.03128375485539436, -0.07329216599464417, 0.12134621292352676, -0.11183981597423553, 0.02485392987728119, -0.062367234379053116, 0.10797715187072754, -0.06427543610334396, -0.07360014319419861, 0.0051111094653606415, -0.07017236948013306, 0.04747195169329643, 0.0815836489200592, 0.035088300704956055, 0.054647088050842285, -0.019689930602908134, -0.017052479088306427, -0.02157120779156685, -0.09226112812757492, -0.014638489112257957, 0.050370026379823685, -0.06669918447732925, -0.10364044457674026, -0.13664007186889648, 0.05382919684052467, -0.07137321680784225, -0.03798382729291916, -0.09145759791135788, -0.05012514442205429, 0.12570875883102417, 0.08205284923315048, 0.03466891497373581, -0.009783166460692883, 0.10296838730573654, 0.016903216019272804, -0.10387405008077621, -0.1033477708697319, 0.07137501239776611, -0.01937374286353588, 0.032868821173906326, -0.05383683368563652, -0.06780694425106049, 0.02505415491759777, 0.1116008535027504, 0.07223570346832275, 0.05411361902952194, 0.029106128960847855, 0.08561523258686066, -0.09172125160694122, 0.0646815299987793, 0.042755961418151855, 0.067424476146698, 0.034409936517477036, -0.03524569049477577, 0.01826019398868084, -0.1048320084810257, 0.01335325837135315, 0.007511144038289785, 0.005463513545691967, -0.11806612461805344, 0.1438562572002411, 0.04783166944980621, -0.05462685227394104, -0.026197442784905434, -0.0956297367811203, 0.09388416260480881, -0.044777028262615204, -0.008257212117314339, -0.039485447108745575, 0.061010584235191345, -0.0746961161494255, 0.09026746451854706, -0.11907359957695007, -0.11888182908296585, 0.12191533297300339, -0.08822248131036758, -0.11937107890844345, -0.030248446390032768, -0.051355790346860886, 0.021297892555594444, -0.01849721372127533, -0.10931072384119034, -0.0554840974509716, -0.04239583760499954, 0.06710343062877655, -0.12188663333654404, 0.08606073260307312, -0.11612287908792496, -0.11789970844984055, 0.10597317665815353, 0.019780680537223816, -0.05006490647792816, -0.05394802615046501, -0.0025841076858341694, -0.10517142713069916, -0.014992056414484978, 0.0015761768445372581, -0.042163603007793427, -0.12047414481639862, -0.0007241851417347789, -0.08603305369615555, -0.13334907591342926, 0.13252578675746918, 0.05467928200960159, 0.06607675552368164, -0.12048687785863876, 0.04527493193745613, 0.06876591593027115, -0.061456985771656036, -0.05399738624691963, 0.0026349059771746397, 0.05604665353894234, 0.012993155047297478, 0.07072461396455765, 0.08051640540361404, 0.09565833956003189, -0.07343455404043198, -0.09055455029010773, 0.036249835044145584, -0.05113619193434715, 0.11715319007635117, 0.0561995692551136, -0.060179322957992554, -0.01862461306154728, -0.06254088133573532, 0.11580602079629898, 0.09041644632816315, -0.02647896483540535, 0.01596318557858467, -0.007370139472186565, 0.023312466219067574, 0.0005944159929640591, 0.08980388194322586, 0.027659039944410324, 0.006158153992146254, 0.0881580039858818, -0.014947482384741306, 0.010642028413712978, -0.07759832590818405, -0.08748003840446472, -0.017794182524085045, 0.09360147267580032, -0.05253913998603821, 0.0034055691212415695, 0.10343653708696365, -0.011785360053181648, 0.1174876019358635, 0.1308007538318634, -0.052650678902864456, 0.024747848510742188, 0.020540807396173477, -0.022715797647833824, -0.0444205068051815, -0.07708388566970825, 0.003885474056005478, -0.07941348850727081, -0.030762771144509315, -0.020807506516575813, 0.02107318677008152, 0.04309451952576637, -0.010878545232117176, 0.04510486125946045, -0.08070207387208939, 0.014882502146065235, -0.12553250789642334, -0.05639497935771942, 0.0533558614552021, 5.35702783963643e-05, -0.11467428505420685, -0.0511457659304142, -0.06959834694862366, -0.002318907529115677, 0.11073815077543259, -0.06901177018880844, -0.06188276410102844, 0.048959843814373016, 0.08999514579772949, -0.021847335621714592, -0.026040760800242424, 0.00209133792668581, 0.09570418298244476, -0.02657969854772091, -0.027880189940333366, 0.1436697542667389, -0.029127683490514755, -0.09406226873397827, 0.13915255665779114, 0.03463058918714523, 0.0856885090470314, 0.11146815866231918, 0.030083907768130302, -0.0927802175283432, -0.09189341217279434, 0.12909150123596191, 0.1104927659034729, 0.050595492124557495, 0.046665508300065994, -0.06790607422590256, -0.07137037813663483, 0.1336267739534378, 0.07309981435537338, 0.11148995161056519, 0.04025059938430786, 0.13665339350700378, -0.04041382670402527, -0.07715414464473724, 0.07111679762601852, 0.02181161567568779, 0.1138329803943634, -0.04892575368285179, -0.016611993312835693, -0.03743956983089447, 0.11864279955625534, 0.0952526181936264, 0.00828444492071867, -0.05699604004621506, 0.06622827053070068, 0.09386301040649414, -0.06264227628707886, 0.06131235137581825, 0.038376335054636, 0.12361539900302887, -0.06735784560441971, 0.003945103380829096, -0.01838245987892151, 0.10819436609745026, -0.0449804812669754, 0.065833181142807, 0.033118028193712234, -0.03139299899339676, -0.06790371984243393, 0.11576595902442932, 0.09042438119649887, -0.10257850587368011, -0.13248610496520996, -0.045040931552648544, 0.0023987216409295797, 0.10556647181510925, -0.04050317779183388, -0.03304338827729225, -0.02870034985244274, -0.0038234973326325417, -0.07321953028440475, 0.02140934206545353, 0.06921670585870743, 0.05463015288114548, -0.05321696400642395, 0.13767990469932556, 0.08321061730384827, -0.03143995627760887, -0.10751026123762131, 0.07843604683876038, 0.03182627260684967, 0.005843231454491615, 0.07247699797153473, -0.07136319577693939, 0.12582501769065857, -0.07104381173849106, 0.06787983328104019, -0.10067067295312881, 0.042897921055555344, 0.046124402433633804, 0.09124838560819626, -0.1183742955327034, 0.07536401599645615, -0.010159351862967014, 0.0011715677101165056, -0.07169012725353241, -0.04982728138566017, -0.042126040905714035, 0.10048947483301163, 0.0857970342040062, 0.012866866774857044, 0.08248794823884964, -0.07678179442882538, 0.09435097873210907, -0.09116273373365402, 0.03153036907315254, -0.10307919234037399, 0.026408923789858818, 0.03887895494699478, -0.008862853981554508, -0.12027307599782944, 0.06533416360616684, -0.009231527335941792, 0.15493302047252655, -0.0342186838388443, -0.012298200279474258, -0.00548104103654623, 0.04581621661782265, -0.10569322109222412, 0.00358778377994895, -0.02063322626054287, -0.10561652481555939, 0.09465166181325912, -0.017600489780306816, 0.019901450723409653, 0.062186215072870255, 0.0401993989944458, -0.024137457832694054, -0.022111818194389343, -0.0675957128405571, 0.04133305326104164, 0.06930053234100342, 0.02033073827624321, -0.0842384323477745, -0.0407981351017952, -0.09112574905157089, -0.014131806790828705, -0.11836475133895874, -0.05147785320878029, -0.022528711706399918, -0.05794486030936241, -0.03708752617239952, -0.05049509182572365, 0.02095699869096279, -0.012393902987241745, -0.004819022957235575, 0.05730212479829788, 0.12440082430839539, 0.05010262131690979, -0.01465338934212923, -0.05632660165429115, 0.07264599204063416, 0.052911996841430664, 0.06506423652172089, -0.11578325182199478, -0.01748725026845932, -0.09235703945159912, -0.0559641532599926, -0.09294117987155914, -0.12168477475643158, -0.05283398926258087, 0.1501702517271042, 0.13816088438034058, 0.09295623749494553, 0.03326910734176636, -0.11374327540397644, -0.014648376032710075, -0.11620909720659256, 0.14813803136348724, 0.051421090960502625, 0.019550610333681107, -0.07026457786560059, -0.124071404337883, 0.04711738973855972, -0.0523669496178627, -0.01901138946413994, -0.12776824831962585, -0.05616473779082298, -0.012469630688428879, 0.11106345802545547, -0.052554380148649216, -0.06261333078145981, 0.04070424288511276, 0.046375393867492676, -0.03432546183466911, -0.12087665498256683, 0.09890555590391159, -0.083939328789711, -0.02233327366411686, 0.00228786445222795, -0.0675472840666771, 0.025232838466763496, -0.0716170147061348, -0.0731467679142952, -0.1262086182832718, 0.04341926425695419, -0.008724355138838291, -0.07801065593957901, 0.021402306854724884, -0.010274949483573437, -0.09508407115936279, 0.07670601457357407, 0.057057321071624756, 0.07271047681570053, -0.02760360762476921, 0.05376194417476654, 0.08345752954483032, 0.057500097900629044, 0.06295982003211975, 0.021814197301864624, 0.015301646664738655, -0.08553963899612427, -0.0647783949971199, -0.10191899538040161, -0.0724697858095169, 0.020047195255756378, 0.10462424904108047, 0.034540507942438126, -0.1011933982372284, 0.1053154319524765, -0.05552699416875839, -0.010670175775885582, -0.08703890442848206, -0.05088009685277939, 0.041239380836486816, -0.10954258590936661, 0.05492212250828743, 0.002457963302731514, -0.02560882829129696, -0.0458332896232605, 0.07186751812696457, -0.020337695255875587, 0.10148835182189941, -0.03121667169034481, -0.10930384695529938, 0.10430766642093658, -0.04711208492517471, 0.09439605474472046, -0.04597412422299385, 0.0898696631193161, -0.04625222831964493, 0.03130551427602768, 0.09140338003635406, 0.13260330259799957, -0.10030857473611832, 0.06377045065164566, -0.07825677841901779, -0.03750048205256462, -0.1500224620103836, 0.12275030463933945, 0.11199124157428741, -0.05640061944723129, -0.08324196189641953, 0.035696785897016525, 0.08365374803543091, 0.045834142714738846, 0.06300002336502075, -0.10082229971885681, 0.029889974743127823, 0.10548341274261475, 0.07254158705472946, -0.08852159231901169, 0.06144687533378601, 0.03182106092572212, -0.00592421367764473, -0.003199605504050851, -0.0279603973031044, -0.0031500360928475857, -0.036784764379262924, -0.12012996524572372, 0.12852342426776886, 0.09200385212898254, 0.07500742375850677, -0.07945023477077484, 0.05355599522590637, -0.009392136707901955, 0.05607307702302933, 0.08829531073570251, -0.06637416779994965, 0.041849393397569656, -0.1001606360077858, 0.01652829721570015, -0.03202562406659126, -0.08551392704248428, -0.012972370721399784, 0.008767260238528252, 0.023469682782888412, -0.009846961125731468, 0.11262451857328415, 0.07142367959022522, -0.004794711247086525, 0.019552059471607208, 0.08738375455141068, 0.029895726591348648, 0.0409776009619236, 0.11140291392803192, -0.06492524594068527, -0.1032833531498909, 0.06396470218896866, 0.06538134813308716, -0.13559435307979584, 0.09450913220643997, -0.12148993462324142, -0.08753959834575653, -0.05845845118165016, 0.12150385230779648, 0.024569449946284294, 0.025479760020971298, 0.0997781977057457, -0.0006866383482702076, 0.0025213509798049927, -0.08864017575979233, 0.08658719062805176, 0.11319553107023239, 0.09571556746959686, -0.08284113556146622, 0.08481531590223312, 0.1008015125989914, -0.0968836322426796, -0.10802670568227768, 0.07175987958908081, 0.04596792533993721, 0.10657410323619843, -0.056697309017181396, 0.12961769104003906, 0.01498753484338522, -0.04860132560133934, -0.11145090311765671, -0.0818801149725914, 0.016733450815081596, -0.03359942510724068, -0.05474305897951126, -0.032777443528175354, -0.11452624946832657, -0.03717823699116707, 0.05492183938622475, -0.10618915408849716, 0.04779426008462906, -0.019770707935094833, 0.09785996377468109, 0.0770074874162674, -0.055789828300476074, 0.06320364028215408, 0.04833252727985382, 0.10813523828983307, 0.11980976164340973, -0.0471089668571949, -0.15551626682281494, 0.0503765344619751, 0.03822842985391617, -0.021379610523581505, -0.07772059738636017, -0.11775349825620651, 0.07797613739967346, -0.15456338226795197, 0.13692012429237366, 0.05997077375650406, -0.12041354924440384, -0.08627118915319443, -0.1211913600564003, 0.023328255861997604, 0.008200367912650108, 0.12866251170635223, 0.13392792642116547, 0.10226622223854065, 0.10640214383602142, -0.10618405044078827, -0.10011550039052963, -0.11575275659561157, -0.1328403651714325, 0.10076653212308884, -0.1295572966337204, 0.10187263041734695, -0.1218072846531868, -0.0249253548681736, 0.061795610934495926, -0.06865411251783371, 0.07140399515628815, 0.009497423656284809, 0.09611336886882782, -0.11698706448078156, 0.07289621233940125, -0.09581640362739563, -0.08973920345306396, -0.1184849962592125, 0.0084242457523942, -0.12730178236961365, -0.08316024392843246, -0.11710380017757416, -0.09257127344608307, -0.002948520705103874, 0.03630850836634636, -0.14051488041877747, 0.0065594445914030075, -0.09005863219499588, 0.028077788650989532, -0.02110830321907997, 0.08942434936761856, -0.1318335384130478, -0.07159466296434402, 0.07546783238649368, 0.020652910694479942, -0.10137920081615448, 0.08089303225278854, 0.005272816866636276, -0.023573024198412895, 0.024098001420497894, -0.10113567113876343, 0.06262071430683136, 0.035603418946266174, -0.14237605035305023, 0.03877682611346245, -0.09110888838768005, 0.08902470767498016, -0.1419392228126526, 0.09528788179159164, -0.002608764450997114, 0.06327445805072784, -0.100721575319767, 0.0893358662724495, -0.053794171661138535, -0.03791828453540802, -0.10956153273582458, -0.12374573945999146, 0.052251849323511124, 0.10820341110229492, 0.015297000296413898, 0.047454629093408585, 0.12816302478313446, 0.047856464982032776, -0.00646763201802969, 0.12090955674648285, -0.1035587415099144, -0.11436986923217773, -0.08392319083213806, 0.06591559201478958, -0.03321744501590729, -0.06675441563129425, 0.02590714953839779, 0.07728254795074463, -0.00880779791623354, -0.09791965037584305, -0.07677078247070312, -0.08655344694852829, -0.02907523885369301, 0.07661508768796921, -0.0776389017701149, 0.11062764376401901, 0.09780581295490265, -0.09562723338603973, -0.12443054467439651, -0.13601630926132202, 0.1493270993232727, -0.0938074141740799, -0.06717212498188019, -0.07730874419212341, 0.05791996046900749, -0.004187555052340031, 0.005327138584107161, -0.05519111454486847, 0.12451726198196411, 0.09104879945516586, 0.05666587874293327, -0.07534274458885193, -0.027544032782316208, -0.1497536599636078, 0.015723519027233124, 0.12209714949131012, -0.03939400240778923, -0.12701956927776337, 0.04336506500840187, 0.05822119489312172, -0.1268354058265686, 0.0473487451672554, 0.03421350568532944, -0.015978192910552025, -0.08688438683748245, 0.050825394690036774, 0.0859750509262085, -0.11589202284812927, -0.06711149215698242, -0.10471789538860321, -0.058668751269578934, 0.08410244435071945, -0.03628051280975342, 0.0137370266020298, 0.11211859434843063, -0.019563430920243263, 0.05840304121375084, -0.03244917094707489, -0.055542878806591034, -0.057292405515909195, -0.04050207510590553, 0.027486376464366913, 0.026632634922862053, -0.1438872516155243, 0.12634986639022827, -0.03536634147167206, 0.07045987248420715, 0.008324829861521721, -0.07720061391592026, -0.1067265123128891, -0.007456505671143532, 0.11557995527982712, 0.030086444690823555, 