{
  "format": "layers-model",
  "generatedBy": "custom-python-converter",
  "convertedBy": null,
  "modelTopology": {
    "keras_version": "2.15.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "LSTM",
            "name": "lstm",
            "config": {
              "name": "lstm",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [
                null,
                30,
                99
              ],
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dropout",
            "name": "dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "name": "lstm_1",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dropout",
            "name": "dropout_1",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "name": "dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "name": "dropout_2",
            "config": {
              "name": "dropout_2",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "name": "dense_1",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 12,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "lstm/weight_0",
          "shape": [
            99,
            256
          ],
          "dtype": "float32",
          "offset": 0,
          "byteLength": 101376
        },
        {
          "name": "lstm/weight_1",
          "shape": [
            64,
            256
          ],
          "dtype": "float32",
          "offset": 101376,
          "byteLength": 65536
        },
        {
          "name": "lstm/weight_2",
          "shape": [
            256
          ],
          "dtype": "float32",
          "offset": 166912,
          "byteLength": 1024
        },
        {
          "name": "lstm_1/weight_0",
          "shape": [
            64,
            256
          ],
          "dtype": "float32",
          "offset": 167936,
          "byteLength": 65536
        },
        {
          "name": "lstm_1/weight_1",
          "shape": [
            64,
            256
          ],
          "dtype": "float32",
          "offset": 233472,
          "byteLength": 65536
        },
        {
          "name": "lstm_1/weight_2",
          "shape": [
            256
          ],
          "dtype": "float32",
          "offset": 299008,
          "byteLength": 1024
        },
        {
          "name": "dense/weight_0",
          "shape": [
            64,
            32
          ],
          "dtype": "float32",
          "offset": 300032,
          "byteLength": 8192
        },
        {
          "name": "dense/weight_1",
          "shape": [
            32
          ],
          "dtype": "float32",
          "offset": 308224,
          "byteLength": 128
        },
        {
          "name": "dense_1/weight_0",
          "shape": [
            32,
            12
          ],
          "dtype": "float32",
          "offset": 308352,
          "byteLength": 1536
        },
        {
          "name": "dense_1/weight_1",
          "shape": [
            12
          ],
          "dtype": "float32",
          "offset": 309888,
          "byteLength": 48
        }
      ]
    }
  ]
}