{
  "format": "layers-model",
  "generatedBy": "custom-converter",
  "convertedBy": "TensorFlow.js Converter",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              30,
              99
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "lstm_input"
          },
          "registered_name": null
        },
        {
          "module": "keras.layers",
          "class_name": "LSTM",
          "config": {
            "name": "lstm",
            "trainable": true,
            "dtype": "float32",
            "batch_input_shape": [
              null,
              30,
              99
            ],
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "time_major": false,
            "units": 64,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "recurrent_initializer": {
              "module": "keras.initializers",
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.0,
            "recurrent_dropout": 0.0,
            "implementation": 2
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              30,
              99
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              30,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "LSTM",
          "config": {
            "name": "lstm_1",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "time_major": false,
            "units": 64,
            "activation": "tanh",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "recurrent_initializer": {
              "module": "keras.initializers",
              "class_name": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.0,
            "recurrent_dropout": 0.0,
            "implementation": 2
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              30,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 12,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "lstm/lstm_cell/kernel:0",
          "shape": [
            99,
            256
          ],
          "dtype": "float32",
          "offset": 0,
          "byteLength": 101376
        },
        {
          "name": "lstm/lstm_cell/recurrent_kernel:0",
          "shape": [
            64,
            256
          ],
          "dtype": "float32",
          "offset": 101376,
          "byteLength": 65536
        },
        {
          "name": "lstm/lstm_cell/bias:0",
          "shape": [
            256
          ],
          "dtype": "float32",
          "offset": 166912,
          "byteLength": 1024
        },
        {
          "name": "lstm_1/lstm_cell/kernel:0",
          "shape": [
            64,
            256
          ],
          "dtype": "float32",
          "offset": 167936,
          "byteLength": 65536
        },
        {
          "name": "lstm_1/lstm_cell/recurrent_kernel:0",
          "shape": [
            64,
            256
          ],
          "dtype": "float32",
          "offset": 233472,
          "byteLength": 65536
        },
        {
          "name": "lstm_1/lstm_cell/bias:0",
          "shape": [
            256
          ],
          "dtype": "float32",
          "offset": 299008,
          "byteLength": 1024
        },
        {
          "name": "dense/kernel:0",
          "shape": [
            64,
            32
          ],
          "dtype": "float32",
          "offset": 300032,
          "byteLength": 8192
        },
        {
          "name": "dense/bias:0",
          "shape": [
            32
          ],
          "dtype": "float32",
          "offset": 308224,
          "byteLength": 128
        },
        {
          "name": "dense_1/kernel:0",
          "shape": [
            32,
            12
          ],
          "dtype": "float32",
          "offset": 308352,
          "byteLength": 1536
        },
        {
          "name": "dense_1/bias:0",
          "shape": [
            12
          ],
          "dtype": "float32",
          "offset": 309888,
          "byteLength": 48
        }
      ]
    }
  ]
}